config/betamocks/cache/mvi/profile/796149080.yml

---
:method: :post
:body: <env:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Header/><env:Body><idm:PRPA_IN201306UV02
  xmlns="urn:hl7-org:v3" xmlns:idm="http://vaww.oed.oit.va.gov" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  ITSVersion="XML_1.0" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd"><id
  extension="WSDOC1709080105349000037213409" root="2.16.840.1.113883.4.349"/><creationTime
  value="20170908010535"/><versionCode code="3.0"/><interactionId extension="PRPA_IN201306UV02"
  root="2.16.840.1.113883.1.6"/><processingCode code="T"/><processingModeCode code="T"/><acceptAckCode
  code="NE"/><receiver typeCode="RCV"><device determinerCode="INSTANCE" classCode="DEV"><id
  extension="200VGOV" root="2.16.840.1.113883.4.349"/></device></receiver><sender
  typeCode="SND"><device determinerCode="INSTANCE" classCode="DEV"><id extension="200M"
  root="2.16.840.1.113883.4.349"/></device></sender><acknowledgement><typeCode code="AA"/><targetMessage><id
  extension="200VGOV-a990ec1d-595c-41dc-9984-b5897939dc99" root="1.2.840.114350.1.13.0.1.7.1.1"/></targetMessage><acknowledgementDetail><code
  codeSystemName="MVI" code="132" displayName="IMT"/><text>Identity Match Threshold</text></acknowledgementDetail><acknowledgementDetail><code
  codeSystemName="MVI" code="120" displayName="PDT"/><text>Potential Duplicate Threshold</text></acknowledgementDetail></acknowledgement><controlActProcess
  classCode="CACT" moodCode="EVN"><code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV02"/><subject
  typeCode="SUBJ"><registrationEvent classCode="REG" moodCode="EVN"><id nullFlavor="NA"/><statusCode
  code="active"/><subject1 typeCode="SBJ"><patient classCode="PAT"><id extension="1008692950V235502^NI^200M^USVHA^P"
  root="2.16.840.1.113883.4.349"/><id extension="0000001008692950V235502000000^PI^200ESR^USVHA^A"
  root="2.16.840.1.113883.4.349"/><id extension="32318142^PI^200CORP^USVBA^A" root="2.16.840.1.113883.4.349"/><id
  extension="796149080^PI^200BRLS^USVBA^A" root="2.16.840.1.113883.4.349"/><id extension="1008692950^PN^200PROV^USDVA^A"
  root="2.16.840.1.113883.4.349"/><statusCode code="active"/><patientPerson><name
  use="L"><given>RUSSELL</given><given>JAMES</given><family>FREEMAN</family></name><administrativeGenderCode
  code="M"/><birthTime value="19691105"/><asOtherIDs classCode="SSN"><id extension="796149080"
  root="2.16.840.1.113883.4.1"/><scopingOrganization determinerCode="INSTANCE" classCode="ORG"><id
  root="1.2.840.114350.1.13.99997.2.3412"/></scopingOrganization></asOtherIDs><birthPlace><addr><city>JACKSONVILLE</city><state>FL</state><country>USA</country></addr></birthPlace></patientPerson><subjectOf1><queryMatchObservation
  classCode="COND" moodCode="EVN"><code code="IHE_PDQ"/><value value="167" xsi:type="INT"/></queryMatchObservation></subjectOf1></patient></subject1><custodian
  typeCode="CST"><assignedEntity classCode="ASSIGNED"><id root="2.16.840.1.113883.4.349"/></assignedEntity></custodian></registrationEvent></subject><queryAck><queryId
  extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/><queryResponseCode code="OK"/><resultCurrentQuantity
  value="1"/></queryAck><queryByParameter><queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/><statusCode
  code="new"/><modifyCode code="MVI.COMP1"/><initialQuantity value="1"/><parameterList><livingSubjectAdministrativeGender><value
  code="M"/><semanticsText>Gender</semanticsText></livingSubjectAdministrativeGender><livingSubjectBirthTime><value
  value="19691105"/><semanticsText>Date of Birth</semanticsText></livingSubjectBirthTime><livingSubjectId><value
  extension="796149080" root="2.16.840.1.113883.4.1"/><semanticsText>SSN</semanticsText></livingSubjectId><livingSubjectName><value
  use="L"><given>RUSSELL</given><given>James</given><family>FREEMAN</family></value><semanticsText>Legal
  Name</semanticsText></livingSubjectName></parameterList></queryByParameter></controlActProcess></idm:PRPA_IN201306UV02></env:Body></env:Envelope>
:headers:
  connection: close
  date: Fri, 08 Sep 2017 06:05:29 GMT
  content-length: '4139'
  content-type: text/xml
  set-cookie: JSESSIONID=LJvLZyzTpJrGc3FhnglZ7G3kVh0Cq7qyjMrsSDtWQ9fmW6Nnqby1!544686593;
    path=/; HttpOnly
  x-powered-by: Servlet/2.5 JSP/2.1
:status: 200
